{
  "question": {
    "Q": "Are your gums swollen, and do they bleed easily when you brush or floss your teeth?",
    "Yes": {
      "question": {
        "Q": "See your dentist. Bad breath often results from gingivitis (inflammation Of the gums).",
        "Yes": {},
        "No": {},
        "diagnosis": ["PERIODONTAL DISEASE"]
      }
    },
    "No": {
      "question": {
        "Q": "Is your tongue or the inside of your mouth sore?",
        "Yes": {
          "question": {
            "Q": "See your dentist. An infection or sore in the mouth or on the tongue can cause bad breath. Do you want to continue the diagnosis?",
            "Yes": {
              "tree": {
                "symptom": "SORE MOUTH OR TONGUE"
              }
            },
            "No": {},
            "diagnosis": []
          }
        },
        "No": {
          "question": {
            "Q": "Has it been more than 6 months since your last dental checkup, or do you have a toothache?",
            "Yes": {
              "question": {
                "Q": "See your dentist. Tooth decay may be causing your bad breath.",
                "Yes": {},
                "No": {},
                "diagnosis": ["TOOTH DECAY"]
              }
            },
            "No": {
              "question": {
                "Q": "Do you brush and floss your teeth less often than twice a day?",
                "Yes": {
                  "question": {
                    "Q": "Decaying food particles stuck on and between your teeth can make your breath smell and affect the condition of your teeth and gums.",
                    "Yes": {},
                    "No": {},
                    "diagnosis": ["KEEPING YOUR TEETH AND GUMS HEALTHY"]
                  }
                },
                "No": {
                  "question": {
                    "Q": "Do you wear dentures?",
                    "Yes": {
                      "question": {
                        "Q": "Do you sometimes forget to remove your dentures at night or to clean them thoroughly?",
                        "Yes": {
                          "question": {
                            "Q": "Decaying food particles may be stuck to your dentures, causing bad breath.",
                            "Yes": {},
                            "No": {},
                            "diagnosis": ["DENTURE PROBLEMS"]
                          }
                        },
                        "No": {
                          "question": {
                            "Q": "Have you had garlic, onions, or other strong- smelling foods, or alcohol within the past 24 hours?",
                            "Yes": {
                              "question": {
                                "Q": "Some foods and beverages contain strong-smelling substances that are absorbed into the bloodstream and released into the lungs, where they are exhaled, causing temporary bad breath. Your breath should return to normal within 24 hours of consuming these substances.",
                                "Yes": {},
                                "No": {},
                                "diagnosis": []
                              }
                            },
                            "No": {
                              "question": {
                                "Q": "Do you smoke?",
                                "Yes": {
                                  "question": {
                                    "Q": "Smoking causes bad breath, and inflammation caused by the smoke increases the risk of nasal and sinus infections.",
                                    "Yes": {},
                                    "No": {},
                                    "diagnosis": [
                                      "COLDS",
                                      "SINUSITIS",
                                      "HOW TO QUIT SMOKING"
                                    ]
                                  }
                                },
                                "No": {
                                  "question": {
                                    "Q": "Is your temperature 100F or higher, or do you have frequent sore throats?",
                                    "Yes": {
                                      "question": {
                                        "Q": "See your doctor. Bad breath sometimes occurs with a fever. Some people have tiny pockets in their tonsils that trap bacteria, resulting in chronic TONSILLITIS. Do you want to continue the diagnosis?",
                                        "Yes": {
                                          "tree": {
                                            "symptom": "FEVER"
                                          }
                                        },
                                        "No": {},
                                        "diagnosis": ["TONSILLITIS"]
                                      }
                                    },
                                    "No": {
                                      "question": {
                                        "Q": "Do you have a persistent cough that produces foul-smelling mucus?",
                                        "Yes": {
                                          "question": {
                                            "Q": "See your doctor. You may have BRONCHIECTASIS.",
                                            "Yes": {},
                                            "No": {},
                                            "diagnosis": ["BRONCHIECTASIS"]
                                          }
                                        },
                                        "No": {
                                          "question": {
                                            "Q": "Do you breathe through your mouth?",
                                            "Yes": {
                                              "question": {
                                                "Q": "Talk to your doctor or dentist. Constantly breathing through the mouth dries up saliva, which creates an environment in which bacteria that cause bad breath can multiply.",
                                                "Yes": {},
                                                "No": {},
                                                "diagnosis": []
                                              }
                                            },
                                            "No": {
                                              "question": {
                                                "Q": "See your doctor or dentist if your bad breath persists.",
                                                "Yes": {},
                                                "No": {},
                                                "diagnosis": []
                                              }
                                            },
                                            "diagnosis": []
                                          }
                                        },
                                        "diagnosis": []
                                      }
                                    },
                                    "diagnosis": []
                                  }
                                },
                                "diagnosis": []
                              }
                            },
                            "diagnosis": []
                          }
                        },
                        "diagnosis": []
                      }
                    },
                    "No": {},
                    "diagnosis": []
                  }
                },
                "diagnosis": []
              }
            },
            "diagnosis": []
          }
        },
        "diagnosis": []
      }
    },
    "diagnosis": []
  }
}
