{
    "question": {
        "Q": "Was the feeling of faintness accompanied by dizziness?",
        "Yes": {
            "tree": {
                "symptom": "DIZZINESS"
            }
        },
        "No": {
            "question": {
                "Q": "Did you stand up suddenly after sitting, lying down, or crouching, or had you just gotten up after a few days in bed?",
                "Yes": {
                    "question": {
                        "Q": "Are you taking medication for high blood pressure?",
                        "Yes": {
                            "question": {
                                "Q": "See your doctor. Your blood pressure may have fallen too low and your doctor may need to adjust the dosage of your medication or prescribe a different drug.",
                                "Yes": {},
                                "No": {},
                                "diagnosis": []
                            }
                        },
                        "No": {
                            "question": {
                                "Q": "See your doctor. You probably felt faint because of a temporary drop in blood pressure.",
                                "Yes": {},
                                "No": {},
                                "diagnosis": []
                            }
                        },
                        "diagnosis": []
                    }
                },
                "No": {
                    "question": {
                        "Q": "Were you exercising more vigorously than usual, and were you short of breath just before you felt faint?",
                        "Yes": {
                            "question": {
                                "Q": "See a doctor immediately. You may have an ARRHYTHMIA. Or you may have an abnormal heart valve.",
                                "Yes": {},
                                "No": {},
                                "diagnosis": []
                            }
                        },
                        "No": {
                            "question": {
                                "Q": "Have you not eaten for some time, or do you have diabetes?",
                                "Yes": {
                                    "question": {
                                        "Q": "See your doctor if you have diabetes so you can discuss ways to control your blood sugar better. Low blood sugar may be causing you to feel faint. Drinking something sweet or eating something sugary or starchy will probably make you feel better.",
                                        "Yes": {},
                                        "No": {},
                                        "diagnosis": []
                                    }
                                },
                                "No": {
                                    "question": {
                                        "Q": "Did you spend several hours in strong sunlight or in very hot or stuffy conditions?",
                                        "Yes": {
                                            "question": {
                                                "Q": "EMERGENCY Get medical help now! Call 123 or your local emergency number or have someone take you to the nearest hospital emergency department. You could have heat exhaustion, which can lead to heatstroke, a life-threatening condition.",
                                                "Yes": {},
                                                "No": {},
                                                "diagnosis": []
                                            }
                                        },
                                        "No": {
                                            "question": {
                                                "Q": "Have you had one or more of the following symptoms? \n• Numbness or tingling in any part of your body \n• Blurred vision \n• Confusion \n• Difficulty speaking \n• Loss of movement in your arms or legs",
                                                "Yes": {
                                                    "question": {
                                                        "Q": "EMERGENCY Get medical help now! Call 123 or your local emergency number or have someone take you to the nearest hospital emergency department. You may have had a STROKE or a TRANSIENT ISCHEMIC ATTACK.",
                                                        "Yes": {},
                                                        "No": {},
                                                        "diagnosis": [
                                                            "STROKE",
                                                            "TRANSIENT ISCHEMIC ATTACK"
                                                        ]
                                                    }
                                                },
                                                "No": {
                                                    "question": {
                                                        "Q": "Do you have heart disease, or did your heartbeat speed up or slow down just before you felt faint?",
                                                        "Yes": {
                                                            "question": {
                                                                "Q": "Did you lose consciousness?",
                                                                "Yes": {
                                                                    "question": {
                                                                        "Q": "See a doctor immediately. Your loss of consciousness may have been caused by a serious abnormal heart rhythm.",
                                                                        "Yes": {},
                                                                        "No": {},
                                                                        "diagnosis": []
                                                                    }
                                                                },
                                                                "No": {
                                                                    "question": {
                                                                        "Q": "See your doctor. You may have a disorder of heart rate and rhythm, such as an ARRHYTHMIA.",
                                                                        "Yes": {},
                                                                        "No": {},
                                                                        "diagnosis": [
                                                                            "ARRHYTHMIA"
                                                                        ]
                                                                    }
                                                                },
                                                                "diagnosis": []
                                                            }
                                                        },
                                                        "No": {
                                                            "question": {
                                                                "Q": "Were you breathing very deeply or rapidly before ou felt faint?",
                                                                "Yes": {
                                                                    "question": {
                                                                        "Q": "Feeling faint was probably caused by hyperventilation, possibly because you were anxious or stressed.",
                                                                        "Yes": {},
                                                                        "No": {},
                                                                        "diagnosis": []
                                                                    }
                                                                },
                                                                "No": {
                                                                    "question": {
                                                                        "Q": "Did you feel faint after a stressful event?",
                                                                        "Yes": {
                                                                            "question": {
                                                                                "Q": "Stress can affect the nerves that control blood pressure, causing a person to feel faint.",
                                                                                "Yes": {},
                                                                                "No": {},
                                                                                "diagnosis": []
                                                                            }
                                                                        },
                                                                        "No": {
                                                                            "question": {
                                                                                "Q": "Did you feel faint while doing any of the following? \n• Coughing \n• Urinating \n• Stretching \n• Holding your breath",
                                                                                "Yes": {
                                                                                    "question": {
                                                                                        "Q": "See your doctor if you faint or feel faint more than once. Any of these activities can occasionally affect the oxygen supply to the brain.",
                                                                                        "Yes": {},
                                                                                        "No": {},
                                                                                        "diagnosis": []
                                                                                    }
                                                                                },
                                                                                "No": {
                                                                                    "question": {
                                                                                        "Q": "Are you over 50?",
                                                                                        "Yes": {
                                                                                            "question": {
                                                                                                "Q": "Does raising or turning your head make you feel faint?",
                                                                                                "Yes": {
                                                                                                    "question": {
                                                                                                        "Q": "See your doctor. This symptom can occur in a disorder involving the nerves and bones in the neck called cervical osteoarthritis. See your eye doctor if you wear bifocals; they may be improperly fitted.",
                                                                                                        "Yes": {},
                                                                                                        "No": {},
                                                                                                        "diagnosis": [
                                                                                                            "OSTEOARTHRITIS"
                                                                                                        ]
                                                                                                    }
                                                                                                },
                                                                                                "No": {
                                                                                                    "question": {
                                                                                                        "Q": "Do you feel unusually tired, or are you often short of breath?",
                                                                                                        "Yes": {
                                                                                                            "question": {
                                                                                                                "Q": "See your doctor. You may have a form of ANEMIA or CONGESTIVE HEART FAILURE. If you are a woman of childbearing age and you feel unusually tired, you may be pregnant.",
                                                                                                                "Yes": {},
                                                                                                                "No": {},
                                                                                                                "diagnosis": [
                                                                                                                    "ANEMIA",
                                                                                                                    "CONGESTIVE HEART FAILURE"
                                                                                                                ]
                                                                                                            }
                                                                                                        },
                                                                                                        "No": {
                                                                                                            "question": {
                                                                                                                "Q": "See your doctor if you are unable to make a diagnosis from this chat.",
                                                                                                                "Yes": {},
                                                                                                                "No": {},
                                                                                                                "diagnosis": []
                                                                                                            }
                                                                                                        },
                                                                                                        "diagnosis": []
                                                                                                    }
                                                                                                },
                                                                                                "diagnosis": []
                                                                                            }
                                                                                        },
                                                                                        "No": {
                                                                                            "question": {
                                                                                                "Q": "Do you feel unusually tired, or are you often short of breath?",
                                                                                                "Yes": {
                                                                                                    "question": {
                                                                                                        "Q": "See your doctor. You may have a form of ANEMIA or CONGESTIVE HEART FAILURE. If you are a woman of childbearing age and you feel unusually tired, you may be pregnant.",
                                                                                                        "Yes": {},
                                                                                                        "No": {},
                                                                                                        "diagnosis": [
                                                                                                            "ANEMIA",
                                                                                                            "CONGESTIVE HEART FAILURE",
                                                                                                            "CONFIRMING A PREGNANCY"
                                                                                                        ]
                                                                                                    }
                                                                                                },
                                                                                                "No": {
                                                                                                    "question": {
                                                                                                        "Q": "See your doctor if you are unable to make a diagnosis from this chat.",
                                                                                                        "Yes": {},
                                                                                                        "No": {},
                                                                                                        "diagnosis": []
                                                                                                    }
                                                                                                },
                                                                                                "diagnosis": []
                                                                                            }
                                                                                        },
                                                                                        "diagnosis": []
                                                                                    }
                                                                                },
                                                                                "diagnosis": []
                                                                            }
                                                                        },
                                                                        "diagnosis": []
                                                                    }
                                                                },
                                                                "diagnosis": []
                                                            }
                                                        },
                                                        "diagnosis": []
                                                    }
                                                },
                                                "diagnosis": []
                                            }
                                        },
                                        "diagnosis": []
                                    }
                                },
                                "diagnosis": []
                            }
                        },
                        "diagnosis": []
                    }
                },
                "diagnosis": []
            }
        },
        "diagnosis": []
    },
    "age-group": ""
}