{
    "question": {
        "Q": "Are you taking any medication?",
        "Yes": {
            "question": {
                "Q": "Talk to your doctor. Some drugs can cause twitching and trembling.",
                "Yes": {},
                "No": {},
                "diagnosis": []
            }
        },
        "No": {
            "question": {
                "Q": "Is the twitching limited to brief flickering movements of one small area of your body, such as an eyelid?",
                "Yes": {
                    "question": {
                        "Q": "See your doctor if the twitching bothers you, if you feel sick, or if the affected muscles seem weak. Minor muscle twitching often results from tension or fatigue.",
                        "Yes": {},
                        "No": {},
                        "diagnosis": []
                    }
                },
                "No": {
                    "question": {
                        "Q": "Is the trembling or shaking limited to one part of your body?",
                        "Yes": {
                            "question": {
                                "Q": "Is the trembling worse when you are not moving the affected part of the body?",
                                "Yes": {
                                    "question": {
                                        "Q": "See your doctor. You could have a disorder of the nervous system called PARKINSON'S DISEASE, especially if you are over age 60.",
                                        "Yes": {},
                                        "No": {},
                                        "diagnosis": [
                                            "PARKINSON'S DISEASE"
                                        ]
                                    }
                                },
                                "No": {
                                    "question": {
                                        "Q": "Have you recently stopped drinking alcohol after a long period of heavy drinking?",
                                        "Yes": {
                                            "question": {
                                                "Q": "See your doctor. Trembling or shaking is a common response of the body to withdrawal from alcohol.",
                                                "Yes": {},
                                                "No": {},
                                                "diagnosis": []
                                            }
                                        },
                                        "No": {
                                            "question": {
                                                "Q": "Have you been drinking a lot more caffeine-containing beverages (such as coffee or cola) than usual?",
                                                "Yes": {
                                                    "question": {
                                                        "Q": "Caffeine is a stimulant and can make you jittery. The trembling should stop when you stop consuming caffeine.",
                                                        "Yes": {},
                                                        "No": {},
                                                        "diagnosis": []
                                                    }
                                                },
                                                "No": {
                                                    "question": {
                                                        "Q": "Do you have two or more of the following symptoms? \n• Excessive sweating \n• Unexplained fatigue \n• Bulging eyes \n• unexplained weight loss",
                                                        "Yes": {
                                                            "question": {
                                                                "Q": "See your doctor. You may have an overactive thyroid gland.",
                                                                "Yes": {},
                                                                "No": {},
                                                                "diagnosis": []
                                                            }
                                                        },
                                                        "No": {
                                                            "question": {
                                                                "Q": "Call your doctor. A tendency to tremble or shake can run in families and is Often brought on by ANXIETY or stress.",
                                                                "Yes": {},
                                                                "No": {},
                                                                "diagnosis": []
                                                            }
                                                        },
                                                        "diagnosis": []
                                                    }
                                                },
                                                "diagnosis": []
                                            }
                                        },
                                        "diagnosis": []
                                    }
                                },
                                "diagnosis": []
                            }
                        },
                        "No": {
                            "question": {
                                "Q": "Does the trembling consist of occasional sudden spasms (jerking movements) of the body or limbs?",
                                "Yes": {
                                    "question": {
                                        "Q": "Do the spasms occur only when you are about to fall asleep, and do they stop on their own?",
                                        "Yes": {
                                            "question": {
                                                "Q": "Such nighttime spasms are normal.",
                                                "Yes": {},
                                                "No": {},
                                                "diagnosis": []
                                            }
                                        },
                                        "No": {
                                            "question": {
                                                "Q": "See your doctor. You may have RESTLESS LEGS SYNDROME. In rare cases, spasms are a sign of a neurological disorder such as PARKINSON'S DISEASE.",
                                                "Yes": {},
                                                "No": {},
                                                "diagnosis": [
                                                    "RESTLESS LEGS SYNDROME",
                                                    "PARKINSON'S DISEASE"
                                                ]
                                            }
                                        },
                                        "diagnosis": []
                                    }
                                },
                                "No": {
                                    "question": {
                                        "Q": "See your doctor if you are unable to make a diagnosis from this chat.",
                                        "Yes": {},
                                        "No": {},
                                        "diagnosis": []
                                    }
                                },
                                "diagnosis": []
                            }
                        },
                        "diagnosis": []
                    }
                },
                "diagnosis": []
            }
        },
        "diagnosis": []
    },
    "age-group": ""
}